dance/src/Documents/Занятие/Занятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Занятие</name>
  <attributes>
    <name>Зал</name>
    <type>
      <types>CatalogRef.Залы</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ученики</name>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Ученики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

dance/src/Documents/Занятие/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Группа") Тогда
		
		Группа = ДанныеЗаполнения;

		Для Каждого ТекСтрокаУченики из ДанныеЗаполнения.Ученики Цикл
			НоваяСтрока = Ученики.Добавить();
			НоваяСтрока.Ученик = ТекСтрокаУченики.Ученик;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
